#
# 请定义一个函数 mySort，参数为一个列表，参数列表中的元素都是整数.
# mySort 函数需要将参数列表中的元素按从小到大排序，最终返回一个新的list。
#
# 请按下面算法的思路实现函数：
#
# 1. 创建一个新的列表newList
# 2. 先找出所有元素中最小的，append在newList里面
# 3. 再找出剩余的所有元素中最小的，append在newList里面
# 4. 依次类推，直到所有的元素都放到newList里面

def mySort(alist):
    newlist = []
    if type(alist)!=list:
        print(str(alist)+"不是列表")
        return []
    else:
        print (str (alist) + "是列表")
        for i in range(0, alist.__len__ () - 1):
            if type(alist[i])==int:
                # print (alist[i])
                for j in range(0, alist.__len__ () - i -1):
                    if alist[j] < alist[j + 1]:
                        alist[j + 1], alist[j] = alist[j], alist[j + 1]
                newlist.append(alist[alist.__len__ () - i - 1])
            else:
                print ("参数值"+str(alist)+"中的元素"+str(alist[i])+"是非整数，不继续排序")
                return []
        newlist.append (alist[0])
    return newlist

print(__name__)

if __name__ == '__main__':
    print("++++++++test01++++++++++++++++++++++++++++++++++++++++")
    alist = ["", 55, 84, 21, 4, 955]
    print(mySort(alist))
    print("++++++++test02++++++++++++++++++++++++++++++++++++++++")
    alist02 = [5.6, 55, 84, 21, 4, 955, 0, 55, 9.5, 2187]
    print(str(mySort(alist02)))
    print("++++++++test0210++++++++++++++++++++++++++++++++++++++++")
    alist0210 = [55, 84, 21, 4, 955, 0, 55, 9.5, 2187]
    print(str(mySort(alist0210)))
    print("++++++++test03++++++++++++++++++++++++++++++++++++++++")
    alist03 = (0, 55, 84, 21, 4, 955)
    print(str(mySort(alist03)))
    print("++++++++test04++++++++++++++++++++++++++++++++++++++++")
    alist04 = [55, 84, 21, 4, 955, 0, 55, 2187]
    print(str(mySort(alist04)))
    """
    ['', 55, 84, 21, 4, 955]是列表
    参数值['', 55, 84, 21, 4, 955]中的元素是非整数，不继续排序
    []
    ++++++++test02++++++++++++++++++++++++++++++++++++++++
    [5.6, 55, 84, 21, 4, 955, 0, 55, 9.5, 2187]是列表
    参数值[5.6, 55, 84, 21, 4, 955, 0, 55, 9.5, 2187]中的元素5.6是非整数，不继续排序
    []
    ++++++++test0210++++++++++++++++++++++++++++++++++++++++
    [55, 84, 21, 4, 955, 0, 55, 9.5, 2187]是列表
    参数值[955, 84, 2187, 55, 55, 21, 9.5, 4, 0]中的元素9.5是非整数，不继续排序
    []
    ++++++++test03++++++++++++++++++++++++++++++++++++++++
    (0, 55, 84, 21, 4, 955)不是列表
    []
    ++++++++test04++++++++++++++++++++++++++++++++++++++++
    [55, 84, 21, 4, 955, 0, 55, 2187]是列表
    [0, 4, 21, 55, 55, 84, 955, 2187]

    Process finished with exit code 0
    """
